app/views/bookmarks/index.html.haml

SELECT "hashtags".* FROM "hashtags" INNER JOIN "bookmarks_hashtags" ON "hashtags"."id" = "bookmarks_hashtags"."hashtag_id" WHERE "bookmarks_hashtags"."bookmark_id" = ?  [["bookmark_id", 1]]
---
    = link_to bookmark.url, bookmark
    = bookmark.hashtags.map(&:title).join(', ')