app/controllers/bookmarks_controller.rb

SELECT "bookmarks".* FROM "bookmarks"
---
	def index
		if params[:tag]
			@bookmarks = Bookmark.tagged_with(params[:tag])
		else
			@bookmarks = Bookmark.all

SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT 1  [["id", nil]]
---
	def show
		@bookmark = Bookmark.find(params[:id])

SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT 1  [["id", 4]]
---
	def edit
		@bookmark = Bookmark.find(params[:id])

SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = ?  [["id", 1]]
---
	def destroy
		@bookmark = Bookmark.find(params[:id])
		name = @bookmark.title

    if @bookmark.destroy