app/controllers/incoming_controller.rb

  def create
      #decoded_body = nil
      sender = params['sender']
      subject = params['subject']
      body_plain = params["body-plain"]
      user = User.find_by_email  params["sender"]
          if !user
            head 200 && return
          end
          url = /\b(([\w-]+:\/\/?|www[.])[^\s()<>]+(?:\([\w\d]+\)|([^[:punct:<>"]\s]|\/)))/.match(params["body-plain"])
          @bookmark = user.bookmarks.build(url: params[:"body-plain"])
          @bookmark.save!
          @hashtags = /#\w+/.match(params["Subject"])
          puts "Hashtag value: #{@hashtag}"
          @hashtag = Hashtag.new(title: @hashtags)
          @hashtag.save!
                  head 200

          head 200
  end
end

---
SELECT  "users".* FROM "users" WHERE "users"."email" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["email", "nicholasnadel@gmail.com"]]
INSERT INTO "bookmarks" ("created_at", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-12-04 17:45:04.019508"], ["updated_at", "2014-12-04 17:45:04.019508"], ["url", "www.theverge.com\r\n"], ["user_id", 1]]
INSERT INTO "hashtags" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-12-09 22:05:49.907641"], ["title", "#ruby"], ["updated_at", "2014-12-09 22:05:49.907641"]]